In [68]:
import numpy as np
import pandas as pd

train=pd.read_csv("/Users/mac/Desktop/Kaggle/Titanic/titanic/train.csv")
test=pd.read_csv("/Users/mac/Desktop/Kaggle/Titanic/titanic/test.csv")
print(train.shape,test.shape)

(891, 12) (418, 11)

In [69]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [70]:
train=train.drop("Name",axis=1)
train.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 11 columns]

In [71]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [72]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [73]:
train["Age"].fillna((train["Age"].median()),inplace=True)
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [74]:
train=train.drop("Cabin",axis=1)

In [75]:
train["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [76]:
train["Embarked"].fillna("S",inplace=True)
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [77]:
train.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 10 columns]

In [78]:
train["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [79]:
train["SibSp"].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [80]:
train["Parch"].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [81]:

train.drop("Ticket",axis=1)

     PassengerId  Survived  Pclass     Sex  ...  SibSp  Parch     Fare  Embarked
0              1         0       3    male  ...      1      0   7.2500         S
1              2         1       1  female  ...      1      0  71.2833         C
2              3         1       3  female  ...      0      0   7.9250         S
3              4         1       1  female  ...      1      0  53.1000         S
4              5         0       3    male  ...      0      0   8.0500         S
..           ...       ...     ...     ...  ...    ...    ...      ...       ...
886          887         0       2    male  ...      0      0  13.0000         S
887          888         1       1  female  ...      0      0  30.0000         S
888          889         0       3  female  ...      1      2  23.4500         S
889          890         1       1    male  ...      0      0  30.0000         C
890          891         0       3    male  ...      0      0   7.7500         Q

[891 rows x 9 columns]

In [82]:
Pclass=train["Pclass"]
Pclass=pd.get_dummies(Pclass,drop_first=True,prefix="Pclass")
Pclass.head()

   Pclass_2  Pclass_3
0         0         1
1         0         0
2         0         1
3         0         0
4         0         1

In [83]:
SibSp=train["SibSp"]
SibSp=pd.get_dummies(SibSp,drop_first=True,prefix="SibSp")
SibSp.head()

   SibSp_1  SibSp_2  SibSp_3  SibSp_4  SibSp_5  SibSp_8
0        1        0        0        0        0        0
1        1        0        0        0        0        0
2        0        0        0        0        0        0
3        1        0        0        0        0        0
4        0        0        0        0        0        0

In [84]:
Sex=train["Sex"]
Sex=pd.get_dummies(Sex,drop_first=True,prefix="Sex")
Sex.head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [85]:
Parch=train["Parch"]
Parch=pd.get_dummies(Parch,drop_first=True,prefix="Parch")
Parch.head()

   Parch_1  Parch_2  Parch_3  Parch_4  Parch_5  Parch_6
0        0        0        0        0        0        0
1        0        0        0        0        0        0
2        0        0        0        0        0        0
3        0        0        0        0        0        0
4        0        0        0        0        0        0

In [86]:
Embarked=train["Embarked"]
Embarked=pd.get_dummies(Embarked,drop_first=True,prefix="Embarked")
Embarked.head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [87]:
train_data=pd.concat([train,Embarked,Sex,Parch,Pclass,SibSp],axis=1)
train_data.head()

   PassengerId  Survived  Pclass     Sex  ...  SibSp_3  SibSp_4  SibSp_5 SibSp_8
0            1         0       3    male  ...        0        0        0       0
1            2         1       1  female  ...        0        0        0       0
2            3         1       3  female  ...        0        0        0       0
3            4         1       1  female  ...        0        0        0       0
4            5         0       3    male  ...        0        0        0       0

[5 rows x 27 columns]

In [88]:
train_data.drop(["PassengerId","Pclass","Sex","SibSp","Parch","Ticket","Embarked"],axis=1,inplace=True)
train_data.head()

   Survived   Age     Fare  Embarked_Q  ...  SibSp_3  SibSp_4  SibSp_5  SibSp_8
0         0  22.0   7.2500           0  ...        0        0        0        0
1         1  38.0  71.2833           0  ...        0        0        0        0
2         1  26.0   7.9250           0  ...        0        0        0        0
3         1  35.0  53.1000           0  ...        0        0        0        0
4         0  35.0   8.0500           0  ...        0        0        0        0

[5 rows x 20 columns]

In [89]:
train_data.columns

Index(['Survived', 'Age', 'Fare', 'Embarked_Q', 'Embarked_S', 'Sex_male',
       'Parch_1', 'Parch_2', 'Parch_3', 'Parch_4', 'Parch_5', 'Parch_6',
       'Pclass_2', 'Pclass_3', 'SibSp_1', 'SibSp_2', 'SibSp_3', 'SibSp_4',
       'SibSp_5', 'SibSp_8'],
      dtype='object')

In [91]:
X=train_data.loc[:,['Age', 'Fare', 'Embarked_Q', 'Embarked_S', 'Sex_male',
       'Parch_1', 'Parch_2', 'Parch_3', 'Parch_4', 'Parch_5', 'Parch_6',
       'Pclass_2', 'Pclass_3', 'SibSp_1', 'SibSp_2', 'SibSp_3', 'SibSp_4',
       'SibSp_5', 'SibSp_8']]
X.head()

    Age     Fare  Embarked_Q  Embarked_S  ...  SibSp_3  SibSp_4  SibSp_5  SibSp_8
0  22.0   7.2500           0           1  ...        0        0        0        0
1  38.0  71.2833           0           0  ...        0        0        0        0
2  26.0   7.9250           0           1  ...        0        0        0        0
3  35.0  53.1000           0           1  ...        0        0        0        0
4  35.0   8.0500           0           1  ...        0        0        0        0

[5 rows x 19 columns]

In [92]:
y=train_data["Survived"]
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [93]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42)

In [94]:
from sklearn.neighbors import KNeighborsClassifier

model=KNeighborsClassifier()

model.fit(X_train,y_train)

KNeighborsClassifier()

In [95]:
predicted=model.predict(X_test)

In [96]:
from sklearn.metrics import accuracy_score

acc=accuracy_score(y_test,predicted)
print("Accuracy=",acc)

Accuracy= 0.6983240223463687

In [97]:
#Import Random Forest Model
from sklearn.ensemble import RandomForestClassifier

#Create a Gaussian Classifier
clf=RandomForestClassifier(n_estimators=100)

#Train the model using the training sets y_pred=clf.predict(X_test)
clf.fit(X_train,y_train)

y_pred=clf.predict(X_test)

In [98]:
acc=accuracy_score(y_test,y_pred)
print("Accuracy=",acc)

Accuracy= 0.8044692737430168